"""1) Создать класс TrafficLight (светофор) и определить у него один атрибут
color (цвет) и метод running (запуск). Атрибут реализовать как приватный.
В рамках метода реализовать переключение светофора в режимы: красный, желтый,
зеленый. Продолжительность первого состояния (красный) составляет 7 секунд,
второго (желтый) — 2 секунды, третьего (зеленый) — на ваше усмотрение.
Переключение между режимами должно осуществляться только в указанном порядке
(красный, желтый, зеленый). Проверить работу примера, создав экземпляр
и вызвав описанный метод.
Задачу можно усложнить, реализовав проверку порядка режимов,
и при его нарушении выводить соответствующее сообщение и завершать скрипт."""

from time import sleep


class TrafficLight:
    __color = {'Red': 7, 'Yellow': 2, 'Green': 3}

    def running(self):
        for key, count_time in TrafficLight.__color.items():
            print(f'now traffic light -- {key}')
            sleep(count_time)

traffic_light_now = TrafficLight()
traffic_light_now.running()